vsfteam/vsf/source/hal/driver/GigaDevice/GD32H7XX/common/driver.c
const vsf_hw_clk_t VSF_HW_CLK_PLL2P = {
    .clkprescaler_region        = VSF_HW_CLKRST_REGION(0x22, 16, 7),// PLLxP in RCU.PLLX
    .clken_region               = VSF_HW_CLKRST_REGION(0x20, 31, 1),// PLLxPEN in RCU.PLLADDCTL

    .clksrc                     = &VSF_HW_CLK_PLL2_VCO,
    .clktype                    = VSF_HW_CLK_TYPE_CLK,

    .clkprescaler_type          = VSF_HW_CLK_PRESCALER_ADD1_DIV,
    .clkprescaler_min           = 0,
    .clkprescaler_max           = 127,
};
const vsf_hw_clk_t VSF_HW_CLK_PLL2Q = {
    .clkprescaler_region        = VSF_HW_CLKRST_REGION(0x20, 16, 7),// PLLxQ in RCU.PLLADDCTL
    .clken_region               = VSF_HW_CLKRST_REGION(0x20, 29, 1),// PLLxQEN in RCU.PLLADDCTL

    .clksrc                     = &VSF_HW_CLK_PLL2_VCO,
    .clktype                    = VSF_HW_CLK_TYPE_CLK,

    .clkprescaler_type          = VSF_HW_CLK_PRESCALER_ADD1_DIV,
    .clkprescaler_min           = 0,
    .clkprescaler_max           = 127,
};
const vsf_hw_clk_t VSF_HW_CLK_PLL2R = {
    .clkprescaler_region        = VSF_HW_CLKRST_REGION(0x22, 24, 7),// PLLxR in RCU.PLLX
    .clken_region               = VSF_HW_CLKRST_REGION(0x20, 30, 1),// PLLxREN in RCU.PLLADDCTL

    .clksrc                     = &VSF_HW_CLK_PLL2_VCO,
    .clktype                    = VSF_HW_CLK_TYPE_CLK,

    .clkprescaler_type          = VSF_HW_CLK_PRESCALER_ADD1_DIV,
    .clkprescaler_min           = 0,
    .clkprescaler_max           = 127,
};

const vsf_hw_clk_t VSF_HW_CLK_RTCDIV = {
    .clkprescaler_region        = VSF_HW_CLKRST_REGION(0x02, 16, 6),// RTCDIV in RCU.CFG0

    .clksrc                     = &VSF_HW_CLK_HXTAL,
    .clktype                    = VSF_HW_CLK_TYPE_CLK,
    .clkprescaler_type          = VSF_HW_CLK_PRESCALER_SFT,
    .clkprescaler_min           = 2,
    .clkprescaler_max           = 63,
};
static const vsf_hw_clk_t * __VSF_HW_CLK_RTC_CLKSEL_MAPPER[4] = {
    NULL, &VSF_HW_CLK_LXTAL, &VSF_HW_CLK_IRC32K, &VSF_HW_CLK_RTCDIV,
};
const vsf_hw_clk_t VSF_HW_CLK_RTC = {
    .clksel_region              = VSF_HW_CLKRST_REGION(0x1C, 8, 2), // RTCSRC in RCU.BDCTL

    .clksel_mapper              = __VSF_HW_CLK_RTC_CLKSEL_MAPPER,
    .clktype                    = VSF_HW_CLK_TYPE_SEL,
};

static const vsf_hw_clk_t * __VSF_HW_CLK_SYS_CLKSEL_MAPPER[4] = {
    &VSF_HW_CLK_IRC64MDIV, &VSF_HW_CLK_HXTAL, &VSF_HW_CLK_LPIRC4M, &VSF_HW_CLK_PLL0P,
};
const vsf_hw_clk_t VSF_HW_CLK_SYS = {
    .clksel_region              = VSF_HW_CLKRST_REGION(0x02, 0, 2), // SCS in RCU.CFG0

    .clksel_mapper              = __VSF_HW_CLK_SYS_CLKSEL_MAPPER,
    .clktype                    = VSF_HW_CLK_TYPE_SEL,
};

const vsf_hw_clk_t VSF_HW_CLK_PER = {
    .clksel_region              = VSF_HW_CLKRST_REGION(0x23, 14, 2),// PERSEL in RCU.CFG1

    .clksel_mapper              = __VSF_HW_CLK_PLL_CLKSEL_MAPPER,
    .clktype                    = VSF_HW_CLK_TYPE_SEL,
};

static const uint8_t __VSF_HW_CLK_AHB_PRESCALER[16] = {
    0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3, 4, 6, 7, 8, 9,
};
const vsf_hw_clk_t VSF_HW_CLK_AHB = {
    .clkprescaler_region        = VSF_HW_CLKRST_REGION(0x02, 4, 4), // AHBPSC in RCU.CFG0

    .clksrc                     = &VSF_HW_CLK_SYS,
    .clktype                    = VSF_HW_CLK_TYPE_CLK,
    .clkprescaler_mapper        = __VSF_HW_CLK_AHB_PRESCALER,
    .clkprescaler_type          = VSF_HW_CLK_PRESCALER_SFT,
    .clkprescaler_min           = 0,
    .clkprescaler_max           = 9,
};

static const uint8_t __VSF_HW_CLK_PCLK_PRESCALER[8] = {
    0, 0, 0, 0, 1, 2, 3, 4,
};
const vsf_hw_clk_t VSF_HW_CLK_PCLK1 = {
    .clkprescaler_region        = VSF_HW_CLKRST_REGION(0x02, 10, 3),// APB1PSC in RCU.CFG0

    .clksrc                     = &VSF_HW_CLK_AHB,
    .clktype                    = VSF_HW_CLK_TYPE_CLK,

    .clkprescaler_mapper        = __VSF_HW_CLK_PCLK_PRESCALER,
    .clkprescaler_type          = VSF_HW_CLK_PRESCALER_SFT,

    .clkprescaler_min           = 0,
    .clkprescaler_max           = 4,
};
const vsf_hw_clk_t VSF_HW_CLK_PCLK2 = {
    .clkprescaler_region        = VSF_HW_CLKRST_REGION(0x02, 13, 3),// APB2PSC in RCU.CFG0

    .clksrc                     = &VSF_HW_CLK_AHB,
    .clktype                    = VSF_HW_CLK_TYPE_CLK,

    .clkprescaler_mapper        = __VSF_HW_CLK_PCLK_PRESCALER,
    .clkprescaler_type          = VSF_HW_CLK_PRESCALER_SFT,

    .clkprescaler_min           = 0,
    .clkprescaler_max           = 4,
};
const vsf_hw_clk_t VSF_HW_CLK_PCLK3 = {
    .clkprescaler_region        = VSF_HW_CLKRST_REGION(0x02, 27, 3),// APB3PSC in RCU.CFG0

    .clksrc                     = &VSF_HW_CLK_AHB,
    .clktype                    = VSF_HW_CLK_TYPE_CLK,

    .clkprescaler_mapper        = __VSF_HW_CLK_PCLK_PRESCALER,
    .clkprescaler_type          = VSF_HW_CLK_PRESCALER_SFT,

    .clkprescaler_min           = 0,
    .clkprescaler_max           = 4,
};
const vsf_hw_clk_t VSF_HW_CLK_PCLK4 = {
    .clkprescaler_region        = VSF_HW_CLKRST_REGION(0x02, 24, 3),// APB2PSC in RCU.CFG0

    .clksrc                     = &VSF_HW_CLK_AHB,
    .clktype                    = VSF_HW_CLK_TYPE_CLK,

    .clkprescaler_mapper        = __VSF_HW_CLK_PCLK_PRESCALER,
    .clkprescaler_type          = VSF_HW_CLK_PRESCALER_SFT,

    .clkprescaler_min           = 0,
    .clkprescaler_max           = 4,
};

// USARTs

#if VSF_HAL_USE_USART == ENABLED
static const vsf_hw_clk_t * __VSF_HW_CLK_USART_APB1_CLKSEL_MAPPER[4] = {
    &VSF_HW_CLK_APB1, &VSF_HW_CLK_AHB, &VSF_HW_CLK_LXTAL, &VSF_HW_CLK_IRC64MDIV,
};
static const vsf_hw_clk_t * __VSF_HW_CLK_USART_APB2_CLKSEL_MAPPER[4] = {
    &VSF_HW_CLK_APB2, &VSF_HW_CLK_AHB, &VSF_HW_CLK_LXTAL, &VSF_HW_CLK_IRC64MDIV,
};
const vsf_hw_clk_t VSF_HW_CLK_USART0 = {
    .clksel_region              = VSF_HW_CLKSEL_USART0,
    .clksel_mapper              = __VSF_HW_CLK_USART_APB2_CLKSEL_MAPPER,
    .clktype                    = VSF_HW_CLK_TYPE_SEL,
};
