vsfteam/vsf/source/hal/driver/GigaDevice/GD32H7XX/common/driver.c
        VSF_HAL_ASSERT((prescaler >= clk->clkprescaler_min) && (prescaler <= clk->clkprescaler_max));
        vsf_hw_clkrst_region_set(clk->clkprescaler_region, prescaler);
    } else if (freq_hz != 0) {
        uint32_t clk_freq_hz = __vsf_hw_clk_get_src_freq_hz(clk);
        VSF_HAL_ASSERT(clk_freq_hz >= freq_hz);
        return vsf_hw_clk_config(clk, NULL, clk_freq_hz / freq_hz, 0);
    }
    return VSF_ERR_NONE;
}

vsf_err_t vsf_hw_pll_vco_config(const vsf_hw_clk_t *clk, uint_fast8_t src_prescaler, uint32_t vco_freq_hz)
{
    VSF_HAL_ASSERT((clk == &VSF_HW_CLK_PLL0_VCO) || (clk == &VSF_HW_CLK_PLL1_VCO) || (clk == &VSF_HW_CLK_PLL2_VCO));
    VSF_HAL_ASSERT((src_prescaler > 0) && (src_prescaler < 64));
    VSF_HAL_ASSERT((vco_freq_hz >= 150000000) && (vco_freq_hz <= 836000000));

    uint32_t *pll = &(((uint32_t *)RCU)[clk->clkprescaler_region >> 16]);
    uint32_t *pllfrac = &(((uint32_t *)RCU)[(clk->clksel_region >> 16) + 1 + ((clk->clksel_region & 0x1F) >> 2)]);

    uint32_t clksrc_freq_hz = vsf_hw_clk_get_freq_hz(clk->clksrc) / src_prescaler;
    VSF_HAL_ASSERT((clksrc_freq_hz >= 1000000) && (clksrc_freq_hz <= 16000000));

    uint8_t clk_range;
    if (clksrc_freq_hz < 2000000) {
        clk_range = 0;
    } else if (clksrc_freq_hz < 4000000) {
        clk_range = 1;
    } else if (clksrc_freq_hz < 8000000) {
        clk_range = 2;
    } else {
        clk_range = 3;
    }

    if (vco_freq_hz > 420000000) {
        VSF_HAL_ASSERT(vco_freq_hz >= 192000000);
    } else if (vco_freq_hz < 192000000) {
        clk_range |= 1 << 2;
    }
    vsf_hw_clkrst_region_set(clk->clksel_region, clk_range);

    uint32_t clk_div = vco_freq_hz / clksrc_freq_hz;
    uint32_t clkfrac_div = ((uint64_t)(vco_freq_hz % clksrc_freq_hz)) * (1 << 13) / clksrc_freq_hz;
    VSF_HAL_ASSERT((clk_div >= 9) && (clk_div <= 512));

    *pll = (*pll & ~0x7FFF) | src_prescaler | ((clk_div - 1) << 6);
    *pllfrac = clkfrac_div == 0 ? 0 : clkfrac_div | (1 << 15);
    return VSF_ERR_NONE;
}



// this function should be in gd32h7xx_misc.c, but this file is not included.
//  So implement this function here. Use weak in case user include this file.
VSF_CAL_WEAK(nvic_vector_table_set)
void nvic_vector_table_set(uint32_t nvic_vict_tab, uint32_t offset)
{
    SCB->VTOR = nvic_vict_tab | (offset & NVIC_VECTTAB_OFFSET_MASK);
    __DSB();
}





#if VSF_ARCH_CFG_CALLSTACK_TRACE == ENABLED

#include "service/trace/vsf_trace.h"

// re-write HardFault_Handler to dump stack
void HardFault_Handler(void)
{
    uintptr_t stack = vsf_arch_get_stack();
    uintptr_t callstack[16] = { 0 };
    uint_fast16_t num = vsf_arch_get_callstack(stack, callstack, dimof(callstack));

    vsf_trace_error("Hardfault:" VSF_TRACE_CFG_LINEEND);
    vsf_trace_error("dumping stack @ 0x%X:" VSF_TRACE_CFG_LINEEND, stack);
#   if      defined(__VSF64__)
    vsf_trace_buffer(VSF_TRACE_ERROR, (void *)stack, 1024,
        VSF_TRACE_DF_DS(8) | VSF_TRACE_DF_DPL(2) | VSF_TRACE_DF_ADDR | VSF_TRACE_DF_CHAR | VSF_TRACE_DF_NEWLINE);
#   elif    defined(__VSF16__)
    vsf_trace_buffer(VSF_TRACE_ERROR, (void *)stack, 256,
        VSF_TRACE_DF_DS(2) | VSF_TRACE_DF_DPL(8) | VSF_TRACE_DF_ADDR | VSF_TRACE_DF_CHAR | VSF_TRACE_DF_NEWLINE);
#   elif    defined(__VSF8__)
    vsf_trace_buffer(VSF_TRACE_ERROR, (void *)stack, 256,
        VSF_TRACE_DF_DS(1) | VSF_TRACE_DF_DPL(16) | VSF_TRACE_DF_ADDR | VSF_TRACE_DF_CHAR | VSF_TRACE_DF_NEWLINE);
#   else
    vsf_trace_buffer(VSF_TRACE_ERROR, (void *)stack, 256,
        VSF_TRACE_DF_DS(4) | VSF_TRACE_DF_DPL(4) | VSF_TRACE_DF_ADDR | VSF_TRACE_DF_CHAR | VSF_TRACE_DF_NEWLINE);
#   endif

    vsf_trace_error("callstack:" VSF_TRACE_CFG_LINEEND);
    for (uint_fast16_t i = 0; i < num; i++) {
        vsf_trace_error("0x%08X" VSF_TRACE_CFG_LINEEND, callstack[i]);
    }
    while (1);
}
#endif





/*! \note initialize device driver
 *  \param none
 *  \retval true initialization succeeded.
 *  \retval false initialization failed
 */
VSF_CAL_WEAK(vsf_driver_init)
bool vsf_driver_init(void)
{
    return true;
}

/* EOF */
